app/Models/UsersModel.php

INSERT INTO `users` (`fname`, `lname`, `username`, `password`) VALUES ('Eunice', 'De Vero', 'eunjyc', 'f5bb0c8de146c67b44babbf4e6584cc0')
---
    public function registerUser($data){
        $this->insert($data);